"""
Напиши программу, вычисляющую и печатающую площадь прямоугольника со сторонами,
которые передаются на вход программе, разделённые пробелом (например, на вход
программе передаётся строка 8 11, программа печатает 88). Размеры сторон имеют целочисленное значение.
"""

side = input().split()
(' '.join(side[:]))
square = int(side[0]) * int(side[-1])
print(square)
                                                                                                                                                                                            программа печатает 88). Размеры сторон имеют целочисленное значение.